[
{
    "name": "CHAN Hon Fu Raymond",
    "email": "raymond.chan@cityu.edu.hk",
    "education": [],
    "position": [
        "Chair Professor,",
        "Vice-President (Student Affairs),"
    ],
    "research interest": [
        "Raymond Chan graduated with First Class Honors from the Department of Mathematics at The Chinese University of Hong Kong (CUHK) in 1980. Uncertain about what to do next, he stayed in the Department as a full-time instructor after graduation. He then started his graduate study in 1981 with a full fellowship from the Courant Institute of Mathematical Sciences at New York University. He obtained the M.Sc. and Ph.D. degrees in Applied Mathematics there in 1984 and 1985, respectively, under the supervision of Professor Olof Widlund.",
        "Chan began his career as a tenure-track Assistant Professor at the University of Massachusetts at Amherst in 1985. With heart and mind always in Hong Kong, he came back to Hong Kong in 1986, first at The University of Hong Kong (1986-92, tenured) and then at The Hong Kong University of Science and Technology (1993), before joining his Alma Mater (CUHK) in 1993. He was the Associate Director of the Institute of Mathematical Sciences (1996-98), the Associate Dean of Science (2004-09), the Deputy Director of the Hong Kong Bioinformatics Centre (2009-11), and the Head of the Mathematics Department (2012-18). He retired from CUHK in 2019 as an Emeritus Professor to become the founding Dean of the College of Science at City University of Hong Kong (CityU). Since 2021, he has been the Vice-President (Student Affairs) there and the co-Director of the Hong Kong Centre for Cerebro-Cardiovascular Health Engineering.",
        "Chan has published 150 journal papers and authored three books. His 2019 book \"Financial Mathematics, Derivatives and Structured Products\" has been accessed (paid downloaded) 76,000 times on SpringerLink, making it the highest accessed mathematical textbook published by Springer in 2019. Chan was in the ISI Science Citation List of Top Highly-Cited Mathematicians in the world (2001 List) and is ranked in the top 100 in the field of Numerical and Computational Mathematics in Stanford study of the world's top 2% scientists since the ranking started in 2020.",
        "Chan won a Leslie Fox Prize for Numerical Analysis in 1989 at Cambridge, United Kingdom; a Feng Kang Prize of Scientific Computing in 1997 in Beijing, China; a Morningside Award in 1998 in Beijing, China; and 2011 Higher Education Outstanding Scientific Research Output Awards (First Prize) from the Ministry of Education in China. He was elected a Fellow of the US Society of Industrial and Applied Mathematics (SIAM) in 2013, a Fellow of the American Mathematical Society (AMS) in 2021, and a Fellow of the China Society of Industrial and Applied Mathematics (CSIAM) in 2022. Chan was the first and is still the only one from an Asian university elected to SIAM Council since SIAM was established in 1952, and he served for two terms from 2015 to 2020. He is now on the SIAM Board of Trustees. Since 2016, he has been the Vice-President of the International Consortium of Chinese Mathematicians (ICCM).",
        "Chan has served on the editorial boards of many journals, including Asian Journal of Mathematics (co-Chief Editor since 1997), Advances in Computational Mathematics (since 2010), Journal of Mathematical Imaging and Vision (since 2014), Journal of Scientific Computing (since 2013), SIAM Journal on Imaging Sciences (from 2007 to 2017), and SIAM Journal on Scientific Computing (from 2000 to 2008). He presented over 200 invited conference talks in more than 20 countries, including plenary talks at SIAM Conference on Applied Linear Algebra and SIAM Conference on Imaging Science. He also reviewed papers for more than 130 different journals.",
        "His wonderful group of graduate students includes Xiaoqing Jin, the Vice-President of East Asia SIAM and former Head of the Mathematics Department at Macau University; Michael Ng, former Head of Department of Mathematics at the Hong Kong Baptist University, Director of Research at the University of Hong Kong, a SIAM Fellow and a Feng Kang Prize Winner; Wai-Ki Ching, former Head of Department of Mathematics at University of Hong Kong; Hai-Wei Sun, Head of Department of Mathematics at University of Macau; Hao-Min Zhou, a Feng Kang Prize Winner, Zheng-Jian Bai, the first prize winner of Applied Numerical Algebra Prize in 2008; and Xiaohao Cai, the first prize winner of EASIAM Student Paper Prize in 2013. "
    ],
    "image": "https://www.cityu.edu.hk/sites/g/files/asqsls3821/files/styles/crop_scholar_list_103_122/public/scholar/head_2013b_47.jpg?itok=0dMAgfzL"
}
]