[
{
    "name": "CHENG Shuk Han",
    "email": "bhcheng@cityu.edu.hk",
    "education": [],
    "position": [
        "Chair Professor,",
        "Chair Professor,",
        "Director of LSMR,"
    ],
    "research interest": [
        "Nature or nurture: molecular and chemical regulation of vertebrate embryonic development and adult organ regeneration",
        "The primary focus of the Cheng lab is to investigate how molecules and chemicals interact in regulating the fascinating processes of embryonic development and adult organ regeneration. Specifically, we investigate the functions of a family of transcription factors, encoded by the Iroquois homeobox genes, in patterning and specifying the development and functions of the heart and retina. Using the transparent zebrafish embryos as our model organism, we develop computational tools to augment and quantify bio-imaging data of gene expression domains and biodistribution of novel chemicals and nanomedicine. We also adapt the Electrocardiogram (ECG) to measure electric conductance and charges in the 2 mm long zebrafish embryos. Our unique capacity to combine bio-imaging and electrophysiology enables us to correlate different parameters of the cardiovascular anatomy and physiology to altered gene expression or to exposure to chemicals, such as toxicants and drugs. Expanding from this set of tools, we are synthesizing and testing nanomedicine which can over come cancer drug resistance or exert anti-angiogenic actions. The zebrafish is also an amazing model of adult heart regeneration. We are currently using an interdisciplinary approach to extend this animal model for the development of novel cell- or nanomaterial-based therapeutics applicable for regenerative medicine. In collaboration with chemist, robotics engineer and nanomaterial scientist, we use emerging technologies to harvest and modify regenerating heart cells. Our long-term goal is to translate the zebrafish work back to mammals and contribute to the understanding and achievement of organ regeneration."
    ],
    "image": "https://www.cityu.edu.hk/sites/g/files/asqsls3821/files/styles/crop_scholar_list_103_122/public/scholar/1_BMS_CHENG_Shuk_Han_Photo_222.jpg?itok=96fPrW6f"
}
]