[
{
    "name": "LI Duan",
    "email": "dli226@cityu.edu.hk",
    "education": [],
    "position": [
        "Former"
    ],
    "research interest": [
        "Twenty Selected Publications",
        "R. J. Jiang, D. Li and B. Y. Wu, “SOCP reformulation for the generalized trust region",
        "subproblem via a canonical form of two symmetric matrices,” accepted for publication inMathematical Programming, 2017.",
        "X. T. Cui, X. L. Sun, S. S. Zhu, R. J. Jiang and D. Li, “Portfolio optimization with nonparametric Value-at-Risk: A block coordinate descent method,” accepted for publication in INFORMS Journal of Computing, 2017.",
        "B. Y. Wu, X. L. Sun, D. Li and X. J. Zheng, “Quadratic convex reformulations for semi-continuous quadratic programming,” SIAM Journal on Optimization, Vol. 27, No. 3, pp. 1531-1553, 2017.",
        "J. J. Gao, K. Zhou, D. Li and X. R. Cao, “Dynamic mean-LPM and mean-CVAR portfolio optimization in continuous-time,” SIAM Journal on Control and Optimization, Vol. 55, No. 3, pp. 1377-1397, 2017.",
        "X. Y. Cui, D. Li and X. Li, “Mean-variance policy for discrete-time cone-constrained markets: Time consistency in efficiency and the minimum-variance signed supermartingale measure,”Mathematical Finance, Vol. 27, No. 2, pp. 471-504, 2017.",
        "X. Y. Cui, D. Li and Y. Shi, “Self-coordination in time inconsistent stochastic decision problems: A planner-doer game framework,” Journal of Economic Dynamics and Control, Vol. 75, pp. 91-113, 2017.",
        "R. J. Jiang and D. Li, “Simultaneous diagonalization of matrices and its applications in quadratically constrained quadratic programming,” SIAM Journal on Optimization, Vol. 26, No. 3, pp. 1649-1668, 2016.",
        "Y. Shi, X. Y. Cui and D. Li, “Discrete-time behavioral portfolio selection under cumulative prospect theory,” Journal of Economic Dynamics and Control, Vol. 61, pp. 283-302, 2015.",
        "Y. Shi, X. Y. Cui, J. Yao and D. Li, “Dynamic trading with reference point adaptation and loss aversion,” Operations Research, Vol. 63, No. 4, pp. 789-806, 2015.",
        "J. J. Gao and D. Li, “Optimal cardinality constrained portfolio selection,” Operations Research, Vol. 61, No. 3, May-June 2013, pp. 745-761, 2013.",
        "J. Yao and D. Li, “Prospect theory and trading patterns,” Journal of Banking and Finance, Vol. 37, pp. 2793-2805, 2013.",
        "X. T. Cui, S. S. Zhu, X. L. Sun and D. Li, “Nonlinear portfolio selection using approximate parametric value-at-risk,” Journal of Banking and Finance, Vol. 37, pp. 2124-2139, 2013.",
        "J. Yao and D. Li, “Bounded rationality as a source of loss aversion and optimism: A study of psychological adaptation under incomplete information,” Journal of Economic Dynamics and Control, Vol. 37, pp. 18-31, 2013.",
        "X. Y. Cui, D. Li, S. Y. Wang and S. S. Zhu, “Better than dynamic mean-variance: Time inconsistency and free cash flow stream,” Mathematical Finance, Vol. 22, No. 2, pp. 346-378, 2012.",
        "J. J. Gao and D. Li, “Cardinality Constrained Linear-quadratic Optimal Control,” IEEE Transactions on Automatic Control, Vol. 56, No. 8, pp. 1936-1941, 2011.",
        "X. J. Zheng, X. L. Sun, D. Li and Y. Xia, “Duality gap estimation of linear equality constrained binary quadratic programming,” Mathematics of Operations Research, Vol. 35, No. 4, pp. 864-880, November 2010.",
        "X. J. Zheng, X. L. Sun and D. Li, “Convex relaxation for nonconvex quadratically constrained quadratic programming: Matrix cone decomposition and polyhedral convexification,”Mathematical Programming, Series B, Vol. 129 (Special Issue in honor of Prof. Paul Tseng), pp. 301-329, 2011.",
        "Z.Y. Wu, D. Li, L.S. Zhang and X.M. Yang “Peeling off a nonconvex cover of an actual convex problem: Hidden convexity,” SIAM Journal on optimization, vol. 18, pp. 507-536, 2007.",
        "D. Li, F.C. Qian and P.L. Fu, “Variance minimization approach for a class of dual control problems,” IEEE Transactions on Automatic Control, Vol. 47, No. 12, pp. 2010-2020, December 2002.",
        "D. Li and W.-L. Ng, “Optimal dynamic portfolio selection: Multiperiod mean-variance formulation,” Mathematical Finance, Vol. 10, No. 3, pp. 387-406, 2000."
    ],
    "image": "https://www.cityu.edu.hk/sites/g/files/asqsls3821/files/styles/crop_scholar_list_103_122/public/scholar/dli226_56.jpg?itok=TKZGWD8p"
}
]