[
{
    "name": "LIN Sze Ki Carol",
    "email": "carollin@cityu.edu.hk",
    "education": [
        "PhD, Department of Chemical Engineering, The University of Manchester (formerly UMIST), England.\nTitle of PhD thesis: “Succinic acid production from low-cost sustainable raw materials using green processing strategies”\nSupervisor: Professor Colin Webb",
        "Bachelor of Engineering in Chemical and Materials Engineering, First Class Honours, The University of Auckland, New Zealand."
    ],
    "position": [
        "Associate Professor,"
    ],
    "research interest": [
        "There is a growing demand to establish biotechnology-based processes for material, chemical and fuel production which can decrease our dependency on dwindling oil reserves and reduce greenhouse gas emissions. These novel bioprocesses are incorporated into biorefineries, which are integral units converting different renewable-derived feedstocks into a range of useful products as diverse as those from petroleum using environmentally friendly technologies. A number of agricultural-based biorefinery processes have been developed and realised at commercial scale since the past decade. At the same time there are growing concerns over organic waste generation and insufficient resource supply due to the ever-increasing global population and the cradle-to-grave system of material flows in the linear economy.",
        "Therefore, the research in our team aimed at valorising organic waste materials through bioconversion processes to recover their inherent nutrients for transformation into value-added products. Waste-based biorefinery not only provides a means for waste treatment, but also promotes the development of a circular economy by valorising wastes into high-value products. As part of this goal, the recent projects conducted in our group mainly focused on the development of integrated biorefinery strategies to valorise food and textile wastes. Due to the different characteristics of the waste materials, the bio-processes were specifically designed and demonstrated in laboratory- and pilot-scales, accompanied with techno-economic assessment for evaluation of technical and economic feasibility. "
    ],
    "image": "https://www.cityu.edu.hk/sites/g/files/asqsls3821/files/styles/crop_scholar_list_103_122/public/scholar/Dr_Carol_Lin_CityU_2019_1.jpg?itok=XYrAmJ_-"
}
]