[
{
    "name": "LIU Chunhua",
    "email": "chunliu@cityu.edu.hk",
    "education": [
        "Ph.D. in Electrical and Electronic Engineering, The University of Hong Kong\nSenior Member of the IEEE"
    ],
    "position": [
        "Associate Professor,"
    ],
    "research interest": [
        "Electric Motors & Drives, Electric Generators: Permanent-Magnet (PM) Machines & Drives, PM Hybrid-excited Brushless Machines & Drives, Memory Machines & Drives, Magnetic-geared Machines & Drives, Linear Machines & Drives, Superconducting Machines, Magnetless Machines, Double-Stator Machines, Double-Rotor Machines, Machine Design Strategies and Fault-Tolerant Controls.",
        "Electric Vehicle Technologies: Vehicle-to-Grid (V2G), Energy-Efficiency Technologies, Energy Storage and Management Techniques, Electric Propulsion Systems, Electric Variable Transmission Systems, Integrated-Starter-Generator Systems, Magnetic Gears, and EV & Environment Policy.",
        "Sustainable & Renewable Energy Systems: Wind Power Generation System, Solar Power Generation System, Wave Power Generation System, Thermal Power Generation System, Hybrid-Source Sustainable Generation Systems, Isolated Gird-off & Grid-connected Systems.",
        "Smart Grid & Micro Grid Technologies: Advancing Generation Systems, Renewable Energy Integration, Distributed Energy Storages & Management for Grid Applications, Smart Robotic System for Power-Line Fault Diagnosis, Advanced Electric Devices for Power Grids.",
        "Wireless Power Transfer (WPT) Technologies & Power Electronics: Inductive Power Transfer, Magnetic Resonance Coupling for WPT; WPT for Energy Conversion; WPT for Mars Exploring; WPT for Air-Charging of Drones; Brushless DC & AC Drive Circuits, Power Converters, Interface Circuits for Micro Grids, Bidirectional Converters for V2G. Smart Robotic Devices."
    ],
    "image": "https://www.cityu.edu.hk/sites/g/files/asqsls3821/files/styles/crop_scholar_list_103_122/public/scholar/Author_Chunhua_Liu_2_1MB_43.jpg?itok=eS-Dqzdr"
}
]