[
{
    "name": "OU Jeff",
    "email": "jeffou@cityu.edu.hk",
    "education": [],
    "position": [
        "Chair Professor,"
    ],
    "research interest": [
        "Professor Ou is a leading expert in quantum optics. He is specialized in quantum interference and is famous for the Hong-Ou-Mandel interferometer. He pioneered the field of multi-photon interference, which he summarized in the monograph \"Quantum Multi-Photon Interference\" published by Springer in 2007. Professor Ou recently demonstrated experimentally another novel type of quantum interferometer known as \"SU(1,1) interferometer\", which has since been realized with a variety of waves such as atomic spin wave and matter wave, phonon, microwave, etc. Professor Ou's current research focuses on the application of this new interferometer to quantum metrology, quantum sensing, quantum state engineering, quantum information and communication and more fundamental quantum measurement process. He is also interested in quantum entanglement between atoms and photons, temporal mode characterization and engineering of photons, quantum noise of amplifiers. ",
        "Professor Ou is a fellow of American Physical Society and of Optica (formerly Optical Society of America).",
        " ",
        "Representative publications (Summary: 140 peer-reviewed papers, H-index=41)",
        "Recent five years (* denotes primary authors): ",
        "1.    Z. Y. Ou* and Xiaoying Li, “Quantum SU(1,1) interferometers: Basic principles and applications”, APL Photonics 5, 080902 (2020).",
        "2.    Nan Huo, Yuhong Liu, Jiamin Li, Liang Cui, Xin Chen, Rithwik Palivela, Tianqi Xie, Xiaoying Li*, and Z. Y. Ou*, “Direct temporal mode measurement for the characterization of temporally multiplexed high dimensional quantum entanglement in continuous variables”, Phys. Rev. Lett. 124, 213603 (2020).",
        "3.    Xin Chen, Xiaoying Li, and Z. Y. Ou*, “Direct temporal mode measurement of photon pairs by stimulated emission”, Phys. Rev. A 101, 033838 (2020).",
        "4.    Jie Su, Liang Cui, Jiamin Li, Yuhong Liu, Xiaoying Li*, and Z. Y. Ou*, “Versatile and precise quantum state engineering by using nonlinear interferometers”, Optics Express 27, 020479 (2019).",
        "5.    M. V. Chekhova*, and Z. Y. Ou*, “Nonlinear interferometers in quantum optics”, Adv. Opt. & Photonics 8, 104 (2016).",
        "Other significant publications:",
        "1.    F. Hudelist, Jia Kong, Cunjin Liu, Jietai Jing, Z. Y. Ou*, Weiping Zhang, “Quantum metrology with parametric amplifier-based photon correlation interferometers”, Nature Communication 5, 3049 (2014).",
        "2.    Jietai Jing, Cunjin Liu, Zhifan Zhou, Z. Y. Ou*, and Weiping Zhang, “Realization of a nonlinear interferometer with parametric amplifiers” Appl. Phys. Lett. 99, 011110 (2011).",
        "3.    Z. Y. Ou; “Complementarity and Fundamental Limit in Precision Phase Measurement”, Phys. Rev. Lett. 77, 2352 (1996).",
        "4.    Z. Y. Ou, S. F. Pereira, H. J. Kimble*, and K. C. Peng; \"Realization of the Einstein-Podolsky-Rosen Paradox for Continuous Variables\", Phys. Rev. Lett. 68, 3663 (1992).",
        "5.    C. K. Hong, Z. Y. Ou, and L. Mandel*; \"Measurement of Subpicosecond Time Intervals between Two Photons by Interference\", Phys. Rev. Lett. 59, 2044 (1987).",
        " "
    ],
    "image": "https://www.cityu.edu.hk/sites/g/files/asqsls3821/files/styles/crop_scholar_list_103_122/public/scholar/ou_masthead2_3__9.jpg?itok=3UTtTjx6"
}
]