[
{
    "name": "RO Eunseok",
    "email": "eunseoro@cityu.edu.hk",
    "education": [
        "BA (Hankuk University of Foreign Studies), MA (Teachers College, Columbia University), PhD (University of Hawaii at Manoa)"
    ],
    "position": [
        "Former"
    ],
    "research interest": [
        " ",
        "GRANTS",
        "Lee, Y., Suh, J., Gu, M., Cho, E., & Ro, E. (2019-2022). Korea National Research Foundation. ₩272,000,000, Analyzing human-machine interaction through conversation analysis.",
        "Ro, E. (2019-2022). Early Career Scheme, Research Grants Council. HK$343,600, Literacy practices and learning at a university writing center.",
        "Ro, E. (2018-2020). Research Start-Up Grant, City University of Hong Kong. HK$191,800, Interacting with textual objects during speaking consultations for language learning.",
        " ",
        "PUBLICATIONS",
        "Jung, H., & *Ro, E. (2019). Validating common experiences through focus group interaction. Journal of Pragmatics, 143, 169–184. ",
        "Ro, E. (2019). How learning occurs in an extensive reading book club: A conversation analytic perspective. Applied Linguistics, 40(1), 152–175.",
        "Ro, E. (2018). Facilitating an L2 book club: A conversation-analytic study of task management. The Modern Language Journal, 102(1), 181–198.",
        "Ro, E. (2018). Understanding reading motivation from EAP students’ categorical work in a focus group. TESOL Quarterly, 52(4), 772–797.  ",
        "Ro, E. (2016). Examining critical pedagogy with drama in an IEP context. Journal of Language Teaching and Research, 7, 1–8.",
        "Ro, E. (2016). Exploring teachers’ practices and students’ perceptions of extensive reading approach in EAP reading classes. Journal of English for Academic Purposes, 22, 32–41.",
        "Ro, E., & Jung, H-B. (2016). Teacher belief in focus group: A respecification study. English Teaching, 71, 119–145.",
        "Ro, E., & Park, J. (2016). Students’ attitude towards undertaking writing activities on extensive reading. The Journal of Asia TEFL, 13, 186–203.  ",
        "Park, J., & Ro, E. (2015). The core principles of extensive reading in an EAP writing context. Reading in a Foreign Language, 27, 302–308.",
        "Ro, E. (2014). The cognition hypothesis: Task complexity and L2 interaction. NYS TESOL Journal, 1, 82–89.",
        "Ro, E. (2014). Review of the book Academic Reading: College Major and Career Applications (8th ed.), by Kathleen T. McWhorter. The Reading Matrix, 14, 361–364.  ",
        "Ro, E., & Chen, C. A. (2014). Pleasure reading behavior and attitude of non-academic ESL students: A replication study. Reading in a Foreign Language, 26, 49–72.",
        "Ro, E. (2013). A case study of extensive reading with an unmotivated L2 reader. Reading in a Foreign Language, 25, 213–233.",
        "Ro, E., & Ryu, J. (2013). Investigating predictors of nonacademic ESOL learners’ L2 literacy ability. Journal of Research and Practice for Adult Literacy, Secondary, and Basic Education, 2, 82–100.",
        "Note. * = corresponding author",
        " ",
        "PRESENTATIONS AT NATIONAL AND INTERNATIONAL CONFERENCES",
        "Ro, E. (2019, October). “Multimodal constructions of ‘learnables/teachables’ during IELTS preparation sessions.” ALAK International Conference & the 6th East Asia AILA Symposium, Hankuk University of Foreign Studies, Seoul, Korea.",
        "Ro, E. (2019, August). \"A conversation-analytic study of language learning in an extensive reading book club.\" Fifth World Congress in Extensive Reading, Feng Chia University, Taichung, Taiwan.",
        "Ro, E. (2019, June). \"Using notes for task report in a book club: Changing practices.\" 4th Thinking, doing, learning: Usage based perspectives on second language learning, University of Jyväskylä, Finland.",
        "Ro, E., Kim, S., & Kasper, G. (2019, June). \"Assessable texts as agenda in placement meetings.\" Panel talk (organized by Gabriele Kasper, Alfred Rue Burch, & Eunseok Ro), 16th International Pragmatics Conference (IPrA), The Hong Kong Polytechnic University, Hong Kong.",
        "Ro, E. (2019, May). \"Explicit instruction as catalyst for changing task-report practices with notes.\" 3rd CAN-Asia Symposium on L2 Interaction, Ewha Womans University, Seoul, Korea.",
        "Jung, H., & Ro, E. (2018, May). “Validation of common experiences in focus groups.” 2nd CAN-Asia Symposium on L2 Interaction, Kyoto, Japan.",
        "Kasper, G., & Ro, E. (2018, March). “Documents as situated objects in writing assessment meetings.” 12th Georgetown University Round Table, Washington D.C., USA.",
        "Ro, E., Burch, A. R., & Kasper, G. (2017, July). “Development of recipiency in a second language book club.” Panel talk (organized by Simona Pekarek Doehler & Evelyne Berger), 15th International Pragmatics Conference (IPrA), Belfast, Northern Ireland, UK.",
        "Ro, E. (2017, March). “Publishing 101.” Invited panel talk (organized by the AAAL Graduate Student Committee), 39th American Association Applied Linguistics (AAAL) Conference, Portland, Oregon, USA.",
        "Burch, A. R., & Ro, E. (2017, March). “‘It’s OK to ask’: Intervention as catalyst for expanding participation in book club discussions.” Panel talk (organized by Alfred Rue Burch & Eunseok Ro), 39th AAAL Conference, Portland, Oregon, USA.",
        "Kim, S., & Ro, E. (2016, April). “When raters disagree in scoring writing performance assessments for EAP placement tests: Score negotiation as a social activity.” 38th AAAL Conference, Orlando, Florida, USA.",
        "Ro, E. (2016, March). “ER book club: Investigating learning as a social practice.” Invited speaker at the Extensive Reading Workshop, Department of East Asian    Languages and Literatures,UHM, Honolulu, Hawai‘i, USA. ",
        "Suzuki, H., & Ro, E. (2016, February). “Extensive reading in a book club.” 4th Hawai‘i TESOL Conference, Honolulu, Hawai‘i, USA.",
        "Ro, E., & Jung, H. (2015, October). “Revisiting extensive reading principles in an EAP writing class: A focus group study.” 34th Second Language Research Forum (SLRF), Georgia State University, Atlanta, Georgia, USA.",
        "Ro, E. (2015, July). “Teasing in teacher focus group: A discursive construction of teacher belief.” 14th IPrA, University of Antwerp, Antwerp, Belgium.",
        "Ro, E. (2015, March). “Exploring teachers’ practices and students’ perceptions of extensive reading approach in EAP reading classes: A mixed method study.” 37th AAAL Conference, Toronto, Ontario, Canada.",
        "Ro, E. (2015, March). “Extensive reading approach in an EAP context: A case study.” TESOL International Convention & English Language Expo, Toronto, Ontario, Canada.",
        "Ro, E. (2014, August). “Second language reading motivation, extensive reading performance, and teacher engagement.” Motivational Dynamics and Second Language Acquisition Conference, University of Nottingham, Nottingham, UK.",
        "Ro, E., (2014, July). “Critical pedagogy with drama: Could this work in Korean EFL context?” 6th Korea Association of Teachers of English (KATE) Conference, Seoul National University, Seoul, Korea.",
        "Ro, E., & Chen, C. A. (2013, October). “Pleasure reading behavior and attitude of non-academic ESL students: A replication study.” 32nd SLRF, Provo, Utah, USA.",
        "Ro, E., & Chen, C. A. (2013, September). “Reading habits and attitudes towards extensive reading for non-academic ESL learners: A replication study.” Second World Congress in Extensive Reading (ERWC2), Yonsei University, Seoul, Korea.",
        "Ro, E. (2013, July). “An investigation of an unmotivated L2 reader’s affect change with 24 single one-off extensive reading sessions.” 1st Modern English Education Society (MEESO), Sookmyung Women’s University, Seoul, Korea.",
        "Ro, E. (2013, March). “The effects of ER on motivation and anxiety.” TESOL Convention (Graduate Student Forum), Dallas, Texas, USA.",
        "Ro, E., & Ryu, J. (2013, March). “Investigating predictors of nonacademic ESOL learners’ L2 literacy ability.” NYS TESOL 34th Annual Applied Linguistics Winter Conference, Teachers College, Columbia University, New York, USA.",
        "Ro, E., & Kang, S. (2012, July). “Social positioning: ‘A true Korean-American.’” 4th KATE Conference, Sookmyung Women’s University, Seoul, Korea.",
        "Ro, E. (2012, March). “The effects of extensive reading on preposition learning.” TESOL/AL Roundtable Student-Forum program at Teachers College, Columbia University, New York, NY.",
        "Song, J., & Ro, E. (2011, July). “The effects of extensive reading on linguistic development.” 3rd KATE Conference, Yonsei University, Seoul, Korea."
    ],
    "image": "https://www.cityu.edu.hk/sites/g/files/asqsls3821/files/styles/crop_scholar_list_103_122/public/scholar/Screen_Shot_2018_09_07_at_4.07.39_PM_9.png?itok=wLIx8IM6"
}
]